# Section 5.1 Introduction to pandas Data Structures

In [1]:
# Import Series and DataFrame into local namespace
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Problem 1

#### In this problem, you will create a series with an index identifying each data point. The series will contain the numbers 4, 7, -5, 3. The index will be d, b, a and c.

In [2]:
# Insert commenting and code in this cell.
#Creating a series.
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

## Problem 2

#### In this problem, demonstrate how you would check for the value 'b' in the series created above.

In [3]:
# Insert commenting and code in this cell.
#Printing out the contents at index b.
obj2['b']

7

## Problem 3

#### In this problem, you are going to create a Series by passing the dict. This occurs when you have data contained in a Python dict (dictionary). Create a dictionary with the following. Create, pass values, display the values and run isnull to see if any of the values in the Series are null.
<br>
Ohio - 35000<br>
Texas - 71000<br>
Oregon - 16000<br>
Utah - 5000<br>

In [4]:
# Insert commenting and code in this cell.
#Creating a dictionary.
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
#Passing the dict and creating a series
obj3 = pd.Series(sdata)
#Displaying the contents of obj3.
obj3
#Checking to see if any value inside of obj3 is a null value.
obj3.isnull()

Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

## Problem 4

#### In this problem, you will be creating a DataFrame from a dict of equal-length lists. <br>
Create the DataFrame, assign it to the frame variable and display it.<br>
state: Ohio, Ohio, Ohio, Nevada, Nevada, Nevada<br>
year: 2000, 2001, 2002, 2001, 2002, 2003<br>
pop: 1.5, 1.7, 3.6, 2.4, 2.9, 3.2<br>

In [5]:
# Insert commenting and code in this cell.
#Creating a dictionary of lists.
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
#Creating a dataframe of the data dictionary.
frame = pd.DataFrame(data) 
#Displaying the dataframe.
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

## Problem 5

#### In this problem, you are going to add a new column named debt with the default value of 21, 25, 29, 33, 36, 44 for all existing records. Complete this and display the updated DataFrame. This will be using frame from Problem 4.

In [6]:
# Insert commenting and code in this cell.
#Printing out the contents of frame.
frame
#Setting up a column of data for future use.
value = pd.Series([21, 25, 29, 33, 36, 44], index=[0, 1, 2, 3, 4, 5])
#Creating a column called debt and assigning it values.
frame['debt'] = value
#Printing out the new contents of frame.
frame

    state  year  pop  debt
0    Ohio  2000  1.5    21
1    Ohio  2001  1.7    25
2    Ohio  2002  3.6    29
3  Nevada  2001  2.4    33
4  Nevada  2002  2.9    36
5  Nevada  2003  3.2    44

## Problem 6

#### In this problem, please remove the column debt from the frame DataFrame and display the contenst of frame.

In [7]:
# Insert commenting and code in this cell.
#Removing the column debt
del frame['debt']
#printing the frame.
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

# Section 5.3 Summarizing and Computing Descriptive Statistics

## Problem 7

#### In this problem, you will create a DataFrame - df - that will look like the table below. You will need to display the table. <br>

a 1.40  NaN<br>
b 7.10 -4.5<br>
c  NaN  NaN<br>
d 0.75 -1.3<br>

In [9]:
# Insert commenting and code in this cell.
#Creating a dataframe.
my_frame = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                    [np.nan, np.nan], [0.75, -1.3]],
                    index=['a', 'b', 'c', 'd'],
                    columns=['one', 'two'])
#Printing the dataframe.
my_frame

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

## Problem 8

#### In this problem, (1) Use the DataFrame sum method to return the Series containing column sums and (2) use the DataFrame describe method to produce summary statistics. use the DataFrame df from Problem 7.

In [10]:
# Insert commenting and code in this cell.
#returning the sums of the columns.
my_frame.sum()
#Returning summary statistics.
my_frame.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

# Before moving onto Problem 9, you will have to install pandas-datareader. To do this, exit out of Jupyter Notebooks. Then open up the Anaconda Prompt. Then run the command - conda install pandas-datareader. Once this is complete, you can run the following code to prepare for problem 9.

In [11]:
#Importing libraries
import pandas as pd
import pandas_datareader.data as web
#Grabbing data.
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
#Assigning price data to the price variable.
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
#Assigning the volume of the data to the volume variable.
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

## Problem 9

#### In this problem, you will compute and display the percent change in price for the stocks - AAPL, IBM, MSFT, and GOOG. This demonstrates how to pull in data from Yahoo Finance.

In [12]:
# Insert commenting and code in this cell.
#Creating the return values for the stocks.
returns = price.pct_change()
#Returning the end values.
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2022-04-08 -0.011909 -0.006379 -0.014600 -0.017986
2022-04-11 -0.025516 -0.010647 -0.039432 -0.031445
2022-04-12  0.011523 -0.003086 -0.011218 -0.010956
2022-04-13  0.016343  0.001270  0.019712  0.014890
2022-04-14 -0.029988  0.003330 -0.027084 -0.023280

## Problem 10

#### In this problem, you will the unique function to give an array of unique values in a Series. First, create the series obj using the values below. <br>
c, a, d, a, a, b, b, c, c<br>

In [13]:
# Insert commenting and code in this cell.
#Creating a one dimensional series.
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
#Grabbing the unique values and assigning them to a variable called uniques.
uniques = obj.unique()
#Printing out the unique values in the series.
uniques

array(['c', 'a', 'd', 'b'], dtype=object)